content/html/meeting-notes/2012-02-28.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-02-28</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-02-28"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 15:50:28 EDT"/>
<meta name="author" content="Mishal Awadah"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-02-28</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Meeting Notes 2012-02-28</a>
<ul>
<li><a href="#sec-1-1">Setup</a></li>
<li><a href="#sec-1-2">Java</a></li>
<li><a href="#sec-1-3">yasnippet</a></li>
<li><a href="#sec-1-4">The Aftermath</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Meeting Notes 2012-02-28</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Setup</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><b>Max Mintz</b>: What is this for?
<ul>
<li><b>Everyone</b>: Emacs club!
</li>
<li><b>Max Mintz</b>: You're a bunch of geeks!
</li>
</ul>

</li>
<li><b>John</b>: Can I borrow your dongle?
</li>
<li>Zach proposes a golf-style competition (with the vim club).
</li>
<li>Zach is ordering pizza &ndash; and sees a deal!
<ul>
<li><b>Lauren</b>: Don't get taken in by that deal! You have to order
        $10. That's the reason I had two salads and a pizza
        yesterday.
</li>
</ul>

</li>
<li><b>Adam Aviv</b>: So is there a rival vim club?
<ul>
<li><b>Zach</b>: They're still trying to get into text mode.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Java</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><b>Mish</b>: Who can give me a recursive find?
<ul>
<li><b>Adam</b> (slowly): <code>find . -name</code>
</li>
</ul>

</li>
<li>John actually starts talking about java.
<ul>
<li>We watch the emacs java tutorial video, and add MST3000-style
      commentary.
<ul>
<li><b>Rafe</b>: This guy uses K&amp;R for his indentation&hellip;
</li>
<li><b>Andrew</b>: He also codes in Comic Sans!
<ul>
<li>It's not Comic Sans, it's Liberation Silly.
</li>
</ul>

</li>
<li>Zach really wants the autoindentation. Minus the font.
</li>
</ul>

</li>
<li><b>Mish</b>: Scanning for forkbombs? Why don't you use the forkbomb scanners.
<ul>
<li><b>Andrew</b>: I wanted to submit a forkbomb for 551.
</li>
</ul>

</li>
<li>The java tools are out-of-date.
<ul>
<li><b>Andrew</b>: Has nobody used this thing in 15 years?
</li>
<li><b>John</b>: That's a good question.
</li>
<li>They use JDK 1.4.
</li>
</ul>

</li>
<li>John gets bored with figuring out Java versions and switches to
      playing Minecraft.
<ul>
<li><b>Mish</b>: It's ridiculous! John has robots mining his shafts.
</li>
<li>He's programming robots in Lua.
</li>
<li><b>John</b>: It should be rewritten in elisp.
</li>
<li><b>Adam</b>: I don't get the point of Minecraft.
<ul>
<li><b>Mish</b>: Haven't you seen what everyone has built?
</li>
<li><b>Adam</b>: I've ignored it.
</li>
</ul>

</li>
<li><b>Rafe</b>: You guys have seen stoogebot, right? They exploited
        the Quake network protocol.
</li>
<li>Writing game hacks is difficult.
<ul>
<li><b>Rafe</b>: You have to have intimate knowledge of how
          everything works.
</li>
<li><b>Andrew</b>: So intimate.
</li>
</ul>

</li>
</ul>

</li>
<li><b>Mish</b>: Should we make our own JDE then?
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">yasnippet</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>Andrew reintroduces himself.
<ul>
<li><b>Andrew</b>: Hi guys! My name is Andrew Braunstein.
</li>
<li><b>Lauren</b>: Hi Andrew.
</li>
<li><b>Zach</b>: Hi Andrew.
</li>
</ul>

</li>
<li><b>Andrew</b>: Every C program has a main function.
<ul>
<li><b>Rafe</b>: That's not true.
</li>
</ul>

</li>
<li>Growl notifications appear on the projector (showing Andrew's
      laptop)
<ul>
<li><b>John Mayer</b>: sup zach
</li>
<li><b>John Mayer</b>: meister that is
</li>
</ul>

</li>
<li>Andrew opens a new Chrome window.
<ul>
<li><b>John</b>: emacsclub is on your Fave 8? Nice.
</li>
</ul>

</li>
<li><b>Andrew</b>: I don't know what yasnappits are installed for Java.
<ul>
<li>Are you feeling lucky?
<ul>
<li>Or he could just check, with yas/find-snippets.
</li>
</ul>

</li>
</ul>

</li>
<li><b>Zach</b>: AC mode? How is that different from hippie-expand?
</li>
<li>Andrew can autocomplete the keyword "class" or the entire class
      template.
<ul>
<li><b>Andrew</b>: It's yasnippit and ac-mode working together!
</li>
<li><b>Nick</b>: You can do the same thing in vim. [begins explaining]
</li>
<li><b>John</b>: We don't care.
</li>
</ul>

</li>
<li>The yasnippit is completed!
<ul>
<li><b>Andrew</b>: Aaah! Main!
</li>
</ul>

</li>
<li><b>John</b>: <code>clifford = new Dog();</code> !
</li>
<li>The author line is filled in.
<ul>
<li><b>Andrew</b>: Johan Andersson!
</li>
</ul>

</li>
<li>Andrew autocompletes a list. It appears as <code>List&lt;Dog&gt; bfd = new       List&lt;Dog&gt;();</code>
<ul>
<li>Rafe complains that you can't instantiate an interface, and
        thinks this deficiency reflects poorly on the snippet library.
</li>
<li>But wait! One more tab will let you choose ArrayList or
        LinkedList!
</li>
<li><b>Rafe</b>: Damn! They're smarter than I am. &hellip; But what if I
        want to use a TreeList?
</li>
<li>Now Rafe's just trolling.
</li>
</ul>

</li>
<li><b>Rafe</b>: I think we should all pitch in and get a Lisp machine.
</li>
<li><b>Mish</b>: Why are you in vim?
<ul>
<li><b>Andrew</b>: This is less.
</li>
<li><b>Mish</b>: So less is vim.
</li>
<li>Mish is disappointed.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">The Aftermath</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>We are now all playing with <a href="http://wwwtyro.github.com/keyzen">http://wwwtyro.github.com/keyzen</a> .
<ul>
<li><b>Rafe</b>: SO IT HAS COME TO THIS
</li>
<li>Rafe has been waiting to make that xkcd reference the entire
       session.
</li>
</ul>

</li>
<li><b>Andrew</b>: Is that my dongle?
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 15:50:28 EDT</p>
<p class="author">Author: Mishal Awadah</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
